# PathDoesntJoinToBorderRisersFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..PathDoesntJoinToBorderRisersFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Path doesn't join to border risers is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathDoesntJoinToBorderRisersFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathDoesntJoinToBorderRisersFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathDoesntJoinToBorderRisersFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace